import 'package:flutter/material.dart';

// Question model
class Question {
  final String question;
  final List<String> choices;
  final int answer; // 0-based index
  final String? image; // зураг байгаа бол path хадгалах

  Question({
    required this.question,
    required this.choices,
    required this.answer,
    this.image, // optional
  });
}
// "Нэр томъёо ба тодорхойлолт" category-ийн асуултууд
Future<List<Question>> fetchQuestions() async {
  await Future.delayed(const Duration(seconds: 1)); // simulate API delay
  return [
 Question(
  question: 'Аль зурагт гол замыг үзүүлсэн бэ?',
  choices: ['Зөвхөн А', 'Зөвхөн Б', 'Зөвхөн В', 'Зөвхөн Б, В', 'А, Б, В'],
  answer: 4,
  image: 'assets/images/1.png', // Зурагны path
),
    Question(
      question: "Зорчих хэсэг гэж юу вэ?",
      choices: [
        'Тээврийн хэрэгслийн хөдөлгөөнд зориулсан замын хэсэг',
        'Явган зорчигчийн хөдөлгөөнд зориулсан замын хэсэг',
        'Зогсоол болон хөдөлгөөнд зориулагдаагүй замын хэсэг'
      ],
      answer: 0, // A
     
    ),
    Question(
      question: 'Аль зурагт уулзварыг үзүүлсэн бэ?',
      choices: ['Зөвхөн А', 'Зөвхөн Б', 'А, Б'],
      answer: 0, // A
        image: 'assets/images/2.png',
    ),
    Question(
      question: 'Аль нь механикжсан тээврийн хэрэгсэл вэ?',
      choices: ['Мотоцикл', 'Мопед', 'Унадаг дугуй', 'Мотоцикл болон мопед', 'Дээрх бүгд'],
      answer: 0, // A

    ),
    Question(
      question: "Чиглэлийн тээврийн хэрэгсэл гэж юу вэ?",
      choices: [
        'Тогтоосон буудал бүхий чиглэлийн дагуу зорчигч тээвэрлэх зориулалттай автобус, троллейбус',
        'Бүх төрлийн автобус',
        'Хүн тээвэрлэхэд зориулсан тээврийн хэрэгсэл'
      ],
      answer: 0, // A
    ),
    Question(
      question: 'Бүх жин гэж юу вэ?',
      choices: [
        'Тээврийн хэрэгслийн тухайн үеийн жин',
        'Тээврийн хэрэгслийн техникийн тодорхойлолтоор тогтоосон жин',
        'Тээврийн хэрэгслийн өөрийн жин'
      ],
      answer: 1, // B
    ),
    Question(
      question: 'Бодит жин гэж юу вэ?',
      choices: [
        'Тээврийн хэрэгслийн тухайн үеийн жин',
        'Тээврийн хэрэгслийн техникийн тодорхойлолтоор тогтоосон жин',
        'Тээврийн хэрэгслийн даацын хэмжээ'
      ],
      answer: 0, // A
    ),
    Question(
      question: 'Хоёр зорчих хэсэгтэй замыг заана уу?',
      choices: ['Зөвхөн А', 'Зөвхөн Б', 'А, Б'],
      answer: 1, // B
      image: 'assets/images/2.png',
    ),
    Question(
      question: 'Аль зурагт гол замыг үзүүлсэн бэ?',
      choices: ['Зөвхөн А', 'Зөвхөн Б', 'Зөвхөн В', 'Зөвхөн Б, В', 'А, Б, В'],
      answer: 4, // E
      image: 'assets/images/4.png',
    ),
    Question(
      question: 'Аль нь замын хөдөлгөөнд оролцогч вэ?',
      choices: ['Зөвхөн А', 'Зөвхөн Б', 'Зөвхөн В', 'Зөвхөн А, Б', 'Бүгд'],
      answer: 3, // D
      image: 'assets/images/2.png',
    ),
    Question(
      question: "Хэнийг 'Жолооч'-д хамааруулж ойлгох вэ?",
      choices: [
        'Жолоодлогын дадлага хийлгэж яваа багш',
        'Ердийн хөсөг хөтөлж замаар яваа хүн',
        'Унадаг дугуй унаж яваа хүн',
        'Дээрх бүгдийг хамааруулж ойлгоно'
      ],
      answer: 3, // D
    ),
    Question(
      question: 'Зурагт хэдэн эгнээтэй замыг үзүүлсэн бэ?',
      choices: ['Нэг эгнээтэй', 'Хоёр эгнээтэй', 'Гурван эгнээтэй'],
      answer: 1, // B
      image: 'assets/images/2.png',
    ),
    Question(
      question: 'Аль нь Үзэгдэлт хангалтгүй нөхцөл вэ?',
      choices: [
        'Байгалийн тогтоц, газрын тэгш бус байдалд замын дагуух үзэгдэх орчин халхлагдсан байдал',
        'Утаа, тоос боссоноос 300 м-ийн дотор зам харагдахгүй болсон нөхцөл'
      ],
      answer: 1, // B
    ),
    Question(
      question: 'Байр эзлэх гэж юу вэ?',
      choices: [
        'Тээврийн хэрэгслийг зогсоолд байрлуулах үйлдэл',
        'Явж байгаа чигтээ эгнээ байраа солих үйлдэл',
        'Замаас гарах буюу замд нийлэх үйлдэл'
      ],
      answer: 1, // B
    ),
    Question(
      question: 'Аль зурагт Гүйцэж түрүүлэх үйлдлийг үзүүлсэн бэ?',
      choices: ['Зөвхөн А', 'Зөвхөн Б', 'А, Б'],
      answer: 0, // A
      image: 'assets/images/7.png',
    ),
    Question(
      question: 'Зурагт аль үйлдлийг үзүүлсэн бэ?',
      choices: ['Гүйцэх үйлдэл', 'Гүйцэж түрүүлэх үйлдэл', 'Саадыг тойрон гарах үйлдэл'],
      answer: 0, // A
      image: 'assets/images/8.png',
    ),
    Question(
      question: 'Ачаа буулгаж 15 минут зогссон бол ямар үйлдэл хийсэнд тооцогдох вэ?',
      choices: ['Удаан зогсолт', 'Зайлшгүй зогсолт', 'Түр зогсолт'],
      answer: 2, // C
      image: 'assets/images/9.png',
    ),
    Question(
      question: 'Аль нь Саадыг тойрон гарах үйлдэл вэ?',
      choices: [
        'Хориглосон дохиогоор зогсож байгаа тээврийн хэрэгслийг тойрон гарах',
        'Хөдөлгөөний түгжрэлд зогсож байгаа тээврийн хэрэгслийг тойрон гарах',
        'Зайлшгүй зогсолт хийсэн тээврийн хэрэгслийг тойрон гарах',
        'Дээрх бүгд'
      ],
      answer: 2, // C
    ),
    Question(
      question: 'Дараах үйлдлүүдийн аль нь Зайлшгүй зогсолт-д хамаарагдах вэ?',
      choices: [
        'Хориглосон дохиогоор тээврийн хэрэгслээ зогсоох',
        'Ачаа буулгах шаардлагаар тээврийн хэрэгслээ зогсоох',
        'Зорчигчийн биеийн байдал муудсаны улмаас тээврийн хэрэгслээ зогсоох',
        'Дээрх бүх үйлдэл хамаарна'
      ],
      answer: 2, // C
    ),
    Question(
      question: "Суудлын автомашины жолооч 'Зам тавьж өгөх' үйлдлийг зөв гүйцэтгэсэн үү?",
      choices: ['Тийм', 'Үгүй', 'Хурдаа хасаж, зогсож өнгөрүүлсэн бол зөв'],
      answer: 1, // B
      image: 'assets/images/10.png',
    ),
  ];
}
